{"initial": {"name": "Protein Information", "description": "Click on the protein figures to load them into Molstar Viewer."}, "8CTK": {"name": "Membrane protein", "description": "The membrane protein is a crucial element of the viral envelope that orchestrates virus morphogenesis and assembly through its interactions with other viral proteins. It manages the placement of the S protein at the cis-Golgi, the site of virus budding. This protein may function by binding to the cytoplasmic c-terminus of S."}, "7K3G": {"name": "Envelope small membrane protein", "description": "The envelope protein is crucial for virus morphogenesis and assembly. It also functions as a viroporin, forming pentameric protein-lipid pores in host membranes that enable ion transport. The envelope protein is involved in inducing apoptosis and regulates the localization of the S protein at the cis-Golgi, the site of virus budding."}, "6XDC": {"name": "ORF3a protein", "description": "The ORF3a protein is a crucial component in the viral replication process. It forms homotetrameric ion channels, known as viroporins, that are localized at endosomes and lysosomes, which aid in the deacidification of lysosomes, facilitating safe egress of virions via lysosomal trafficking. In addition, the ORF3a protein inhibits autolysosome formation by binding and sequestering the host component VPS39. This action disrupts the fusion of autophagosomes with lysosomes, thereby impairing autophagy and promoting virus egress."}, "6VYB": {"name": "Spike glycoprotein", "description": "The spike protein is a composite structure made up of S1 and S2 proteins. The S1 protein is responsible for binding the virus to the cell membrane by interacting with the host's ACE2 receptor, thus initiating infection. The S2 protein, on the other hand, is a precursor of the fusion protein that is processed during the biosynthesis of the S protein and the formation of the virus particle. It operates as a class I viral fusion protein, mediating the fusion of the virion and cellular membranes. An extensive and irreversible conformational change triggered by S2 leads to the fusion of the viral envelope with the cellular cytoplasmic membrane, resulting in the release of viral genomic RNA into the host cell's cytoplasm."}, "6WVN": {"name": "2'-O-methyltransferase nsp16", "description": "Nsp16 is a methyltransferase that plays a crucial role in the methylation of the 5'-cap structure of viral mRNAs. The presence of an N7-methyl guanosine cap is necessary for the binding of nsp16. This process is vital for the virus to evade the immune system. Additionally, nsp16 may interfere with the host's mRNA splicing in the nucleus by interacting with the pre-mRNA Recognition Domains of the U1 and U2 snRNAs."}, "6WXC": {"name": "Uridylate-specific endoribonuclease nsp15", "description": "Nsp15 is crucial to viral transcription and replication, inhibiting the activation of host cell dsRNA sensors such as MDA5/IFIH1, OAS, and PKR. It operates by dismantling the 5'-polyuridines produced during the replication of the poly(A) region of viral genomic and subgenomic RNAs. This process involves a two-step reaction, first creating a 2'3'-cyclic phosphate (2'3'-cP) through 2'-O transesterification, which is later hydrolyzed to a 3'-phosphate (3'-P). If not broken down, the poly(U) RNA would fuse with poly(A) RNA tails leading to the activation of host dsRNA sensors. Nsp15 may also bind to genomic dsRNA in conjunction with the replication-transcription complex (RTC), contributing to nsp12 discontinuous transcription."}, "7N0C": {"name": "Guanine-N7 methyltransferase nsp14", "description": "Nsp14 is instrumental in viral RNA synthesis, performing two distinct activities. Its N7-guanine methyltransferase activity aids in the formation of the cap structure GpppA-RNA, while its proofreading exoribonuclease activity decreases the virus's sensitivity to RNA mutagens during replication. This protein operates on both single-strand and double-strand RNA in a 3'-5' direction."}, "7NNG": {"name": "Helicase nsp13", "description": "Nsp13 is a multi-functional component that plays a crucial role in viral RNA synthesis. It has a zinc-binding domain located in the N-terminus and exhibits both RNA and DNA duplex-unwinding activities with a 5' to 3' polarity, with the helicase activity being dependent on magnesium. Furthermore, nsp13 binds to the host's TBK1 and inhibits its phosphorylation. This interaction subsequently decreases IRF3 phosphorylation, resulting in reduced IFN-beta production."}, "6YYT": {"name": "RNA-dependent RNA Polymerase", "description": "The RNA-dependent RNA Polymerase (nsp12) is a protein in SARS-CoV-2 that facilitates the transcription of viral genomic and subgenomic RNAs. It works in conjunction with nsp7 and nsp8 to transcribe both strands of genomic RNA. The protein can initiate discontinuous transcription that results in the creation of subgenomic RNAs. Additionally, nsp12 is part of the viral RNA capping enzyme that catalyzes the RNA guanylyltransferase reaction. It has a NiRAN domain that transfers RNA to the amino terminus of NSP9, creating a covalent RNA-protein intermediate, and subsequently transfers RNA to GDP, forming the core cap structure GpppA-RNA."}, "6WXD": {"name": "RNA-capping enzyme subunit nsp9", "description": "Nsp9 is a key component of the viral RNA capping enzyme, catalyzing the RNA guanylyltransferase reaction for genomic and sub-genomic RNAs. It functions with the NiRAN domain of NSP12 to transfer RNA, forming a covalent RNA-protein intermediate, and then to GDP, yielding the core cap structure GpppA-RNA. This protein works with nsp14 and nsp16 methyltransferases to add methyl groups, creating functional cap structures. It interacts with ribosome signal recognition particle RNA (SRP), and, in conjunction with nsp8, inhibits protein integration into the cell membrane, thus disrupting host immune defenses."}, "NSP6": {"name": "Non-structural protein 6", "description": "Nsp6 plays a crucial role in the formation and maintenance of double membrane vesicles (DMVs), replication organelles, which are created by nsp3 and nsp4. Nsp6 is involved in zipping ER membranes and connecting to lipid droplets, which are consumed during DMV formation. Additionally, nsp6 binds to the host TBK1 without altering TBK1 phosphorylation. This interaction with TBK1 subsequently results in decreased IRF3 phosphorylation, leading to reduced IFN-beta production."}, "6LU7": {"name": "3C-like proteinase nsp5", "description": "Nsp5, also known as the Main Proteinase, is a critical protein in SARS-CoV-2 that cleaves the C-terminus of the replicase polyprotein at 11 distinct sites. It can recognize substrates with the core sequence [ILMVF]-Q-|-[SGACN]. nsp5 may also interact with human proteins, such as NLRP1 in lung epithelial cells, activating the NLRP1 inflammasome pathway. Additionally, it could cleave GSDMD, triggering an alternative GSDME-mediated epithelial cell death and potentially enhancing the release of interleukins 1B, 6, 16 and 18. It also has the ability to bind to an ADP-ribose-1''-phosphate (ADRP)."}, "NSP4": {"name": "Non-structural protein 4", "description": "Nsp4 is crucial in the virus's replication process. It collaborates with nsp3 in the formation of double membrane vesicles (DMVs), which serve as replication organelles. Additionally, nsp4 helps in maintaining these DMVs. It works in conjunction with nsp6, which links ER membranes to lipid droplets, thereby facilitating the virus's propagation."}, "6WUU": {"name": "Papain-like protease nsp3", "description": "Nsp3 is a SARS-CoV-2 protein that plays a crucial role in the virus's replication and immune evasion tactics. It aids in the cleavage at the N-terminus of the replicase polyprotein and assembles, with nsp4, the double-membrane vesicles needed for viral replication. nsp3 also hinders the host's innate immune response by blocking the activation and movement of host IRF3 and NF-kappa-B signaling. This protein has deubiquitinating/deISGylating activities and can process both 'Lys-48'- and 'Lys-63'-linked polyubiquitin chains. It selectively cleaves ISG15 from the antiviral protein IFIH1 (MDA5). Moreover, nsp3 can contribute to host ADP-ribosylation by ADP-ribose. It is also involved in the formation and maintenance of the virus's double membrane vesicles (DMVs) replication organelles, with assistance from nsp4 and nsp6."}, "6W9C": {"name": "Papain-like protease nsp3", "description": "Nsp3 is a SARS-CoV-2 protein that plays a crucial role in the virus's replication and immune evasion tactics. It aids in the cleavage at the N-terminus of the replicase polyprotein and assembles, with nsp4, the double-membrane vesicles needed for viral replication. nsp3 also hinders the host's innate immune response by blocking the activation and movement of host IRF3 and NF-kappa-B signaling. This protein has deubiquitinating/deISGylating activities and can process both 'Lys-48'- and 'Lys-63'-linked polyubiquitin chains. It selectively cleaves ISG15 from the antiviral protein IFIH1 (MDA5). Moreover, nsp3 can contribute to host ADP-ribosylation by ADP-ribose. It is also involved in the formation and maintenance of the virus's double membrane vesicles (DMVs) replication organelles, with assistance from nsp4 and nsp6."}, "7MSW": {"name": "Non-structural protein 2", "description": "nsp2 is a viral protein that aids in the suppression of the host's antiviral response by enhancing the mRNA repression of the 4EHP-GYF2 complex. This process, in turn, facilitates the replication of SARS-CoV-2. It is believed to work in conjunction with nsp1, another viral protein that induces ribosome stalling on host mRNA, leading to further mRNA repression."}, "7K3N": {"name": "Host translation inhibitor nsp1", "description": "Nsp1 is a viral protein that inhibits the host's translation process by associating with the open head conformation of the 40S subunit. Its C-terminus binds to and obstructs the ribosomal mRNA entry tunnel, which in turn inhibits the antiviral response triggered by innate immunity or interferons. The nsp1-40S ribosome complex induces an endonucleolytic cleavage near the 5'UTR of host mRNAs, marking them for degradation. However, viral mRNAs are less susceptible to nsp1-mediated translation inhibition due to their 5'-end leader sequence."}, "8FD5": {"name": "Nucleoprotein", "description": "The nucleoprotein is a crucial component of the virus, responsible for packaging the positive strand viral genome RNA into a helical ribonucleocapsid (RNP). It interacts with the viral genome and membrane protein M, playing a fundamental role in virion assembly. Moreover, it significantly enhances the efficiency of subgenomic viral RNA transcription and viral replication."}, "7JX6": {"name": "ORF8 protein", "description": "Plays a role in modulating the host immune response. May act by down-regulating major histocompability complex class I (MHC-I) at cell surface."}, "6Z4U": {"name": "ORF9b protein", "description": "The ORF9b protein is instrumental in suppressing the host's innate immune response. It interacts with the host's TOMM70, a mitochondrial-associated immune response component, and inhibits its binding to HSP90AB1, leading to disruption of the interferon activation pathway. This action effectively hampers the immune response to the virus."}, "7CI3": {"name": "ORF7a protein", "description": "The ORF7a protein is a vital antagonist of the host protein tetherin (BST2), which typically exhibits antiviral properties. ORF7a works by interacting with BST2 and repositioning it to the perinuclear region, effectively neutralizing its antiviral function at the cell membrane."}, "7VPG": {"name": "ORF6 protein", "description": "May play a role in viral double membrane vesicles networks to enhance viral replication."}}