{"desc": "A tiny, invisible enemy known as the Severe Acute Respiratory Syndrome Coronavirus 2 (SARS-CoV-2) unleashed a pandemic that affected every corner of our planet. Its origins trace back to a seafood market in Wuhan, China, where it is believed to have jumped from animals to humans. Since then, SARS-CoV-2 has rapidly spread, challenging our global healthcare systems and scientific community to respond with urgency and innovation.", "virus_desc": "SARS-CoV-2 is an enveloped RNA virus with a diameter of 60~140 nm. Looking from outside, you are only able to see its protein capsid, including the spike (S), envelope (E), and membrane (M) proteins. The nucleocapsid (N) protein is wrapped inside the lipid bilayer. The spikes on its surface promotes fusion of the viral and human cellular membrane, which make the virus look like a crown.", "Principles": "The development of effective therapeutics for COVID-19 relies on a deep understanding of the virus's replication cycle. If you have read the [*Genome & Proteins*](/proteins) page of this website, you may have known that there are some key enzymes involved in the SARS-CoV-2 replication cycle. \n\n**1. Entry Inhibition:** The first line of defense is preventing the virus from entering host cells. Therapies in this category aim to block the interaction between the virus's spike protein and cellular receptors, such as ACE2. Neutralizing antibodies and small molecules may be used to inhibit this crucial initial step. \n\n**2. Viral Replication Inhibition:** Once inside the host cell, the virus must replicate its genetic material. Therapeutics in this stage target viral enzymes involved in replication, such as RNA-dependent RNA polymerase (RdRp).\n\n**3. Protein Processing Inhibition:** During replication, the virus produces large precursor proteins, which are later processed into individual functional proteins. Inhibitors can target this processing step, preventing the virus from generating crucial components needed for replication and assembly.\n\nThe [US FDA](https://www.fda.gov/consumers/consumer-updates/know-your-treatment-options-covid-19) approved two drug, ***Veklury*** and ***Paxlovid***, for COVID-19 therapy, each targeting a distinct protein of the virus.", "Veklury": "The active ingredient in Veklury is known as ***Remdesivir***. It is a nucleotide analogue that specifically targets the RNA-dependent RNA polymerase (RdRp). This essential enzyme is responsible for using nucleotides to replicate viral RNA. In normal circumstances, RNA consists of four primary nucleotides: A, U, C, and G.\n\nYou can visualize RdRp as a zipper pull, guiding the process of bringing two RNA strands together. However, when an abnormal nucleotide is introduced into either of the RNA chains, it acts like a snag in the zipper. This disruption causes the enzyme to become stuck. Unfortunately for the virus, it lacks the mechanism to undo this snag. As a result, the polymerase is permanently disabled, halting the virus's ability to replicate itself.", "Paxlovid": "One of the active components in Paxlovid is known as ***Nirmatrelvir***. This potent agent is highly specific in its approach, targeting the main proteases of SARS-CoV-2.\n\nWhen the virus infiltrates a human cell, it relies on the cell's own organelles to manufacture the components necessary for its replication. Viral proteins undergo a critical post-production process to become functional. The proteases cleave polyproteins at multiple sites, yielding multiple functional proteins.\n\nIn a manner similar to nucleotide analogs, Nirmatrelvir operates as a peptidomimetic inhibitor. It cleverly mimics a normal peptide during the protease's processing attempt. However, here's where Nirmatrelvir's brilliance shines: it forms strong covalent bonds with the enzyme. These bonds are exceptionally strong, resulting in the permanent blockade of the enzyme's active site. In essence, Nirmatrelvir effectively shuts down the enzyme, disrupting the virus's ability to process essential proteins, and thereby inhibiting its replication.", "about": "This website is dedicated to showcasing the incredible capabilities of the **Dash-Molstar** library. Dash-Molstar is a tool that empowers developers to seamlessly integrate Molstar Viewer into their web applications.\n\n*Dash* is a Python web application framework that offers a seamless experience for building interactive, web-based applications with Python. *Molstar* is a cutting-edge molecular structure viewer that takes your visualization game to the next level. On this site, you'll find a demonstration and example usage of Dash-Molstar in action.\n\nFor more information about the Dash-Molstar plugin, you can check the [GitHub repository](https://github.com/everburstSun/dash-molstar). If you have any questions about this plugin, feel free to open an issue on GitHub or [contact Simon](mailto:simonhrsun@gmail.com)."}